# SketchedStairsCurveData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SketchedStairsCurveData Methods
SketchedStairsCurveData Class See Also
---
The SketchedStairsCurveData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurve | Get a copy of the curve that is formed along this boundary. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace